tutorials/compressible/steadyCompressibleFoam/transonicBump/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="steadyCompressibleFoam"

runApplication blockMesh
runApplication $application
